//Домашнее задание 1
alert("Урок № 1 ДЗ № 1");
let Tc = null;
Tc = prompt("Введите температуру в °С ");
let Tf = (9 / 5) * Tc + 32;
alert("Температура " + Tf + "°F");

//Домашнее задание 2
alert("Урок № 1 ДЗ № 2");
let name = "Василий";
let admin = name;
console.log(admin);

//Домашнее задание 3
alert("Урок № 1 ДЗ № 3");
console.log(10 + 10 + "10");
/* Первые два значения складываются как числа
а к третьему приклеиваются, преобразовавшись в строку*/
console.log(10 + "10" + 10);
/* действия выполняются по порядку, т.к. одинаковый приоритет.
В каждом из действий есть строковое значение, следовательно
все слагаемые преобразуются в строки и склеиваются */
console.log(10 + 10 + +"10");
/* Сначала складываются два числа, затем третье значение операндом
"+" преобразуется в число и тоже складывается*/
console.log(10 / -"");
/* унарный минус преобразует "" в 0, который при делении на него 10 даёт
бесконечность (infinity)*/
console.log(10 / +"2,5");
/* Унарный минус не преобразовывает десятичные дроби в числа
а при делении 10 на строку получаем NaN */

//Домашнее задание 4
let mode = "normal";
let my_valu3 = 102;
// let 3my_value3 = "102"; имена переменных не начинаются с чисел
let __hello__ = "world";
let $$$ = "money";
// let !0_world = true; имена переменных не начинаются со знаков, кроме $